/*--------------------------------------------------------------------
  程序L3_7.C : 由键盘输入的一个字符，判断是数字、英文字符还是其它字符
---------------------------------------------------------------------*/
#include <stdio.h>

int main( )
{
    char ch;
    scanf("%c",&ch);
/*在C中"并且"含义即"逻辑与"用"&&"表示，"或者"含义即"逻辑或"用"||"表示*/
    if (ch>='0'&&ch<='9')       /*等价与if (ch>=48&&ch<=57)*/
       printf("%c is a digit.\n",ch);
    else  if ((ch>='A'&&ch<='Z') || (ch>='a'&&ch<='z'))
     /*等价与if ((ch>=65&&ch<=90)||(ch>=97&&ch<=122))*/
       printf("%c is a letter.\n",ch);
	else  printf(" %c is an other character.\n",ch);
     return 0;
}
