/*-------------------------------------------
  程序L1_2.C : 求两数之和
-------------------------------------------*/
#include <stdio.h>                         /* 包含输入输出头文件 */

int main( )                                /* 定义主函数 */
{   int a,b,sum;                           /* 定义整数变量a、b、sum */
    a=123;                                 /* 给a赋值 */
    b=456;                                 /* 给b赋值 */
    sum=a+b;                               /* 令sum=a+b */
    printf("sum is: %d\n",sum);            /* 输出a、b的和sum */
    return 0;
}
