 /*----------------------------------------------------------------
  程序L11_5.C功能：已知二维数组a[2][3]，输出全部元素。
 -----------------------------------------------------------------*/
 #include <stdio.h>
 void main()
 {
  int a[2][3],i,j;
  int *p;
 /* 用坐标法输入二维数组元素 */
  for(i=0;i<2;i++)  
    for(j=0;j<3;j++)
      scanf("%d",&a[i][j]);
 /* 用指针法输出二维数组元素 */
  p=a[0];             /* 等价于p=&a[0][0]; */
  for(;p<a[0]+6;p++)  /* p<&a[1][2]等价于p<a[0]+6 */
    printf("%4d",*p);
  printf("\n");
 }
