 /*---------------------------------------------------------------------
  程序L11_6.C功能：比较指向数组元素的指针变量和指向数组的指针变量的不同。
 -----------------------------------------------------------------------*/
 #include <stdio.h>
 void main()
 {
  int a[2][3]={1,2,3,4,5,6};
  int *p1,(*p2)[3];   /* p1指向数组元素，p2指向包含3个元素的一维数组 */
  /* 用指向数组元素的指针变量输出二维数组元素 */
  p1=a[0]; 
  for(;p1<a[0]+6;p1++)
    printf("%4d",*p1);
  printf("\n");
  /* 用指向一维数组的指针变量输出二维数组元素 */
  p2=a;
  for(;p2<a+2;p2++)
    printf("%4d",*(*p2));
  printf("\n");
 }
