 /*-----------------------------------------------------------------------
  程序L6_7.C : 编写求平方根的函数sqrt2，并输出1.0、1.1、1.2、…、1.9的平方根
  -------------------------------------------------------------------------*/
 #include <stdio.h>
 #include <math.h>
 
 double sqrt2(double x)
 {
  double x0,x1;
  x1=1.0;        /*迭代初值取1.0*/
  if(x>0.0)
    { do 
       {x0=x1;
        x1=(x0+x/x0)/2;
        }while (fabs((x1-x0)/x1)>=1.0e-6);   /* fabs函数计算绝对值*/
      return x1;
     }
  else return x;
  }

 void main( )                     
 {
  float x;
  for(x=1.0;x<2.0;x+=0.1)
      printf("%3.1f   %f\n",x,sqrt2(x));
  }
