  /*----------------------------------------------------------------------
   程序L10_7.C功能：已知一个一维数组a[10]中有10个数，求出第m个数到第n个数
   的和。 其中m、n由键盘输入。
  -----------------------------------------------------------------------*/
 #include <stdio.h>
 int sum(int *q,int n)
 {
  int i,s=0;
  for (i=0;i<n;i++,q++)          
       s+=*q;
  return s;
 }
 void main()      
 {
  int m,n, a[10]={1,2,3,4,5,6,7,8,9,10};
  int *p;
  printf("Please input m and n (m<n<10) :\n");
  scanf ("%d,%d",&m,&n);
  p=a+m-1;  /*数组下标从0开始，所以第m个元素下标为m-1，地址为a+m-1*/
  printf("%d\n", sum(p,n-m+1));
  /*若计算第3个到第5个数的和，实际计算的是第3、4、5共5-3+1个数的和*/
 }
